Qiushi0919/2026-NUEDC-C/firmware/sound-light-controller/empty.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.02.00.05"
 * @v2CliArgs --device "MSPM0G3505" --package "LQFP-64(PM)" --product "mspm0_sdk@2.02.00.05"
 * @versions {"tool":"1.21.1+3772"}
 */

/**
 * Import the modules used in this configuration.
 */
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121        = ADC12.addInstance();
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const GPIO6         = GPIO.addInstance();
const GPIO7         = GPIO.addInstance();
const GPIO8         = GPIO.addInstance();
const GPIO9         = GPIO.addInstance();
const I2C           = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1          = I2C.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const PWM2          = PWM.addInstance();
const PWM3          = PWM.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const SYSTICK       = scripting.addModule("/ti/driverlib/SYSTICK");
const TIMER         = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1        = TIMER.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const UART2         = UART.addInstance();
const UART3         = UART.addInstance();
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
const divider9       = system.clockTree["UDIV"];
divider9.divideValue = 2;

const gate7  = system.clockTree["MFCLKGATE"];
gate7.enable = true;

const multiplier2         = system.clockTree["PLL_QDIV"];
multiplier2.multiplyValue = 4;

const mux3       = system.clockTree["EXCLKMUX"];
mux3.inputSelect = "EXCLKMUX_PLLCLK1_OUT";

const mux4       = system.clockTree["EXHFMUX"];
mux4.inputSelect = "EXHFMUX_XTAL";

const mux8       = system.clockTree["HSCLKMUX"];
mux8.inputSelect = "HSCLKMUX_SYSPLL0";

const mux12       = system.clockTree["SYSPLLMUX"];
mux12.inputSelect = "zSYSPLLMUX_HFCLK";

const pinFunction4                        = system.clockTree["HFXT"];
pinFunction4.inputFreq                    = 40;
pinFunction4.enable                       = true;
pinFunction4.HFXTStartup                  = 10;
pinFunction4.peripheral.$assign           = "SYSCTL";
pinFunction4.peripheral.hfxInPin.$assign  = "PA5";
pinFunction4.peripheral.hfxOutPin.$assign = "PA6";

ADC121.sampClkDiv                        = "DL_ADC12_CLOCK_DIVIDE_8";
ADC121.repeatMode                        = true;
ADC121.adcMem0_name                      = "ADC0_CH0";
ADC121.adcMem1_name                      = "ADC0_CH1";
ADC121.adcMem1chansel                    = "DL_ADC12_INPUT_CHAN_1";
ADC121.adcMem3_name                      = "ADC0_CH3";
ADC121.adcMem3chansel                    = "DL_ADC12_INPUT_CHAN_3";
ADC121.$name                             = "ADC0_VOLTAGE";
ADC121.samplingOperationMode             = "sequence";
ADC121.endAdd                            = 1;
ADC121.enabledADCMems                    = [0];
ADC121.sampleTime0                       = "10ms";
ADC121.enabledInterrupts                 = ["DL_ADC12_INTERRUPT_MEM0_RESULT_LOADED"];
ADC121.peripheral.adcPin0.$assign        = "PA27";
ADC121.adcPin0Config.hideOutputInversion = scripting.forceWrite(false);
ADC121.adcPin0Config.$name               = "ti_driverlib_gpio_GPIOPinGeneric6";

const Board                       = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.peripheral.$assign          = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";

GPIO1.$name                              = "LED1";
GPIO1.port                               = "PORTA";
GPIO1.associatedPins[0].$name            = "PIN_14";
GPIO1.associatedPins[0].internalResistor = "PULL_DOWN";
GPIO1.associatedPins[0].assignedPin      = "14";
GPIO1.associatedPins[0].pin.$assign      = "PA14";

GPIO2.$name                               = "ENCODER";
GPIO2.associatedPins.create(8);
GPIO2.associatedPins[0].direction         = "INPUT";
GPIO2.associatedPins[0].interruptEn       = true;
GPIO2.associatedPins[0].interruptPriority = "0";
GPIO2.associatedPins[0].polarity          = "RISE";
GPIO2.associatedPins[0].assignedPort      = "PORTA";
GPIO2.associatedPins[0].$name             = "OA3";
GPIO2.associatedPins[0].pin.$assign       = "PA31";
GPIO2.associatedPins[1].direction         = "INPUT";
GPIO2.associatedPins[1].interruptEn       = true;
GPIO2.associatedPins[1].interruptPriority = "0";
GPIO2.associatedPins[1].polarity          = "RISE";
GPIO2.associatedPins[1].assignedPort      = "PORTB";
GPIO2.associatedPins[1].$name             = "OB3";
GPIO2.associatedPins[1].pin.$assign       = "PB13";
GPIO2.associatedPins[2].direction         = "INPUT";
GPIO2.associatedPins[2].interruptEn       = true;
GPIO2.associatedPins[2].interruptPriority = "0";
GPIO2.associatedPins[2].polarity          = "RISE";
GPIO2.associatedPins[2].assignedPort      = "PORTA";
GPIO2.associatedPins[2].$name             = "OA4";
GPIO2.associatedPins[2].pin.$assign       = "PA29";
GPIO2.associatedPins[3].direction         = "INPUT";
GPIO2.associatedPins[3].assignedPort      = "PORTB";
GPIO2.associatedPins[3].interruptEn       = true;
GPIO2.associatedPins[3].interruptPriority = "0";
GPIO2.associatedPins[3].polarity          = "RISE";
GPIO2.associatedPins[3].$name             = "OB4";
GPIO2.associatedPins[3].pin.$assign       = "PB3";
GPIO2.associatedPins[4].$name             = "OA1";
GPIO2.associatedPins[4].direction         = "INPUT";
GPIO2.associatedPins[4].assignedPort      = "PORTA";
GPIO2.associatedPins[4].interruptEn       = true;
GPIO2.associatedPins[4].interruptPriority = "0";
GPIO2.associatedPins[4].polarity          = "RISE";
GPIO2.associatedPins[4].pin.$assign       = "PA15";
GPIO2.associatedPins[5].$name             = "OB1";
GPIO2.associatedPins[5].direction         = "INPUT";
GPIO2.associatedPins[5].assignedPort      = "PORTA";
GPIO2.associatedPins[5].interruptEn       = true;
GPIO2.associatedPins[5].interruptPriority = "0";
GPIO2.associatedPins[5].polarity          = "RISE";
GPIO2.associatedPins[5].pin.$assign       = "PA16";
GPIO2.associatedPins[6].$name             = "OA2";
GPIO2.associatedPins[6].direction         = "INPUT";
GPIO2.associatedPins[6].assignedPort      = "PORTB";
GPIO2.associatedPins[6].interruptEn       = true;
GPIO2.associatedPins[6].polarity          = "RISE";
GPIO2.associatedPins[6].interruptPriority = "0";
GPIO2.associatedPins[6].pin.$assign       = "PB10";
GPIO2.associatedPins[7].$name             = "OB2";
GPIO2.associatedPins[7].direction         = "INPUT";
GPIO2.associatedPins[7].assignedPort      = "PORTB";
GPIO2.associatedPins[7].interruptEn       = true;
GPIO2.associatedPins[7].polarity          = "RISE";
GPIO2.associatedPins[7].interruptPriority = "0";
GPIO2.associatedPins[7].pin.$assign       = "PB11";

GPIO3.$name                          = "MOTOR";
GPIO3.associatedPins.create(8);
GPIO3.associatedPins[0].assignedPort = "PORTB";
GPIO3.associatedPins[0].$name        = "AIN3";
GPIO3.associatedPins[0].pin.$assign  = "PB22";
GPIO3.associatedPins[1].assignedPort = "PORTB";
GPIO3.associatedPins[1].$name        = "AIN4";
GPIO3.associatedPins[1].pin.$assign  = "PB23";
GPIO3.associatedPins[2].assignedPort = "PORTB";
GPIO3.associatedPins[2].$name        = "BIN3";
GPIO3.associatedPins[2].pin.$assign  = "PB25";
GPIO3.associatedPins[3].assignedPort = "PORTB";
GPIO3.associatedPins[3].$name        = "BIN4";
GPIO3.associatedPins[3].pin.$assign  = "PB26";
GPIO3.associatedPins[4].$name        = "AIN1";
GPIO3.associatedPins[4].assignedPort = "PORTB";
GPIO3.associatedPins[4].pin.$assign  = "PB6";
GPIO3.associatedPins[5].$name        = "AIN2";
GPIO3.associatedPins[5].assignedPort = "PORTB";
GPIO3.associatedPins[5].pin.$assign  = "PB7";
GPIO3.associatedPins[6].$name        = "BIN1";
GPIO3.associatedPins[6].assignedPort = "PORTB";
GPIO3.associatedPins[6].pin.$assign  = "PB8";
GPIO3.associatedPins[7].$name        = "BIN2";
GPIO3.associatedPins[7].assignedPort = "PORTB";
GPIO3.associatedPins[7].pin.$assign  = "PB9";

